item {
 id: 1
 name: 'car'
}
item {
  id: 2
  name: 'pedestrian'
}
item {
 id: 3
 name: 'van'
}
item {
 id: 4
 name: 'truck'
}



model {
  faster_rcnn {
    num_classes: 4
    image_resizer {
      fixed_shape_resizer{
        height: 300
        width: 993
      }
    }
    feature_extractor {
      type: 'faster_rcnn_resnet101'
      first_stage_features_stride: 16
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        scales: [0.25, 0.5, 1.0, 2.0]
        aspect_ratios: [0.5, 1.0, 2.0]
        height_stride: 16
        width_stride: 16
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 300
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        use_dropout: false
        dropout_keep_probability: 1.0
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.5
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 300
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
  }
}

train_config: {
  batch_size: 1
  optimizer {
    momentum_optimizer: {
      learning_rate: {
        manual_step_learning_rate {
          initial_learning_rate: 0.0001
          schedule {
            step: 500000
            learning_rate: .00001
          }
          schedule {
            step: 700000
            learning_rate: .000001
          }
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "/content/faster_rcnn_resnet101_kitti_2018_01_28/model.ckpt"
  from_detection_checkpoint: true
  num_steps: 25000
  data_augmentation_options {
    random_horizontal_flip {
      probability: 0.5
    }
    random_adjust_brightness {
      max_delta: 0.15
    }
    random_adjust_contrast {
      max_delta: 0.15
    }
  }
}

train_input_reader: {
  label_map_path: "/content/data/kitti_label_map.pbtxt"
  tf_record_input_reader: {
    input_path: "/content/output/kitti.record_train.tfrecord"
  }
}

eval_config: {
  use_moving_averages: false
  num_examples: 500
}

eval_input_reader: {
  label_map_path: "/content/data/kitti_label_map.pbtxt"
  tf_record_input_reader: {
    input_path: "/content/output/kitti.record_val.tfrecord"
  }
}
